//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Menjalankan langkah %d daripada %d: Membina storan entiti";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Menjalankan langkah %d daripada %d: Mencipta pangkalan data butstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Menjalankan langkah %d daripada %d: Mencipta pangkalan data baris gilir permintaan";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Menjalankan langkah %d daripada %d: Memuat turun storan entiti. Terima %s daripada %s setakat ini.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Menjalankan langkah %d daripada %d: Memadam permintaan yang tamat tempoh";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Menjalankan langkah %d daripada %d: Memuatkan metadata";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Menjalankan langkah %d daripada %d: Menjalankan penggabungan baris gilir permintaan";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Menjalankan langkah %d daripada %d: Menjalankan penggabungan transaksi";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Menjalankan langkah %d daripada %d: Menjalankan penggabungan pemadaman penciptaan";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Menjalankan langkah %d daripada %d: Memproses pertanyaan pentakrifan %s menggunakan %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Menjalankan langkah %d daripada %d: Memproses permintaan. Menghantar permintaan pengubahsuaian %s daripada %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Menjalankan langkah %d daripada %d: Menggunakan semula perubahan";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Menjalankan langkah %d daripada %d: Menganalisis data yang diterima";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Menjalankan langkah %d daripada %d: Menerima data daripada pelayan. Terima %s setakat ini.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Menjalankan langkah %d daripada %d: Mengeluarkan hubungan yang dipadam";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Menjalankan langkah %d daripada %d: Mengeluarkan permintaan yang ditentukan sebagai RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Menjalankan langkah %d daripada %d: Menghantar data ke pelayan. Hantar %s setakat ini.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Menjalankan langkah %d daripada %d: Menghantar pangkalan data storan entiti. Hantar %s daripada %s setakat ini.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Menjalankan langkah %d daripada %d: Menghantar pangkalan data baris gilir permintaan. Hantar %s daripada %s setakat ini.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Menjalankan langkah %d daripada %d: Memulakan komunikasi dengan pelayan";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Menjalankan langkah %d daripada %d: Prapemprosesan permintaan sebelum memuat naik";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Menjalankan langkah %d daripada %d: Menunggu untuk muat turun";

